[
 {
   "name": "Vladimir Putin",
   "statement": "Those were local self-defense units",
   "context": "When asked at a March 4, 2014 press conference about the soldiers in Russian-style combat fatigues seizing Crimean airports and military bases, Putin denied they were Russian forces. He claimed they were spontaneous local militia groups who may have bought their uniforms from local military shops.",
   "date": "March 4, 2014"
 },
 {
   "name": "Vladimir Putin",
   "statement": "I see no possibility of Crimea joining Russia",
   "context": "At the same March 4, 2014 news conference, Putin stated Moscow would do nothing to 'provoke' Crimea joining Russia. Two weeks later, he presided over Russian parliament legislation annexing Crimea.",
   "date": "March 4, 2014"
 },
 {
   "name": "Vladimir Putin",
   "statement": "There are no Russian troops in eastern Ukraine",
   "context": "Putin repeatedly denied Russian military involvement in the Donbas conflict during multiple interviews and statements. He claimed only 'volunteers' and local separatists were fighting Ukrainian forces, despite extensive evidence of Russian equipment and personnel.",
   "date": "Multiple occasions 2014-2015"
 },
 {
   "name": "Vladimir Putin",
   "statement": "Russia has no involvement in the MH17 tragedy",
   "context": "Following the downing of Malaysia Airlines Flight 17 on July 17, 2014, Putin and Russian officials consistently denied any Russian involvement. Putin blamed Ukrainian forces and suggested various alternative theories despite evidence the Buk missile came from Russian territory.",
   "date": "July 2014-ongoing"
 },
 {
   "name": "Vladimir Putin",
   "statement": "The operation was not pre-planned",
   "context": "Putin initially claimed the Crimea annexation was a spontaneous response to local requests for protection. In a March 2015 documentary, he admitted he had ordered the operation on February 23, 2014, the day after Yanukovych fled, revealing extensive pre-planning.",
   "date": "March 2014"
 },
 {
   "name": "Viktor Yanukovych",
   "statement": "The EU Association Agreement suspension is temporary",
   "context": "In November 2013, Yanukovych announced the 'temporary' suspension of EU association talks to address Russian economic concerns. He assured EU officials this was merely a pause for negotiations, not abandonment of European integration.",
   "date": "November 21, 2013"
 },
 {
   "name": "Viktor Yanukovych",
   "statement": "Ukraine will sign the EU Association Agreement at the right time",
   "context": "Throughout 2013, Yanukovych repeatedly assured EU and Ukrainian officials that Ukraine would eventually sign the Association Agreement after resolving technical issues. Parliamentary approval in September 2013 was treated as confirmation of his commitment.",
   "date": "Multiple occasions throughout 2013"
 },
 {
   "name": "Viktor Yanukovych",
   "statement": "The protesters are paid foreign provocateurs",
   "context": "During escalating Euromaidan protests, Yanukovych claimed demonstrators were funded by Western intelligence services rather than genuine Ukrainian citizens. He dismissed the movement as artificial foreign interference designed to destabilize Ukraine.",
   "date": "December 2013-January 2014"
 },
 {
   "name": "Viktor Yanukovych",
   "statement": "Security forces are only responding to violent provocations",
   "context": "As police violence escalated against protesters, Yanukovych insisted his security forces were only defending themselves against extremist attacks. He denied ordering the use of lethal force despite documented evidence of systematic violence against peaceful demonstrators.",
   "date": "January-February 2014"
 },
 {
   "name": "Viktor Yanukovych",
   "statement": "I will not request Russian military intervention",
   "context": "At a February 28, 2014 press conference in Russia, Yanukovych insisted military action was 'unacceptable' and denied he would ask for Russian military support. Russian forces had already begun seizing Crimean installations.",
   "date": "February 28, 2014"
 },
 {
   "name": "Igor Girkin (Strelkov)",
   "statement": "We are local Donbas militia defending our homeland",
   "context": "When Girkin first appeared in Sloviansk in April 2014, he claimed to be leading local separatist volunteers. He later admitted he was a Russian GRU colonel who deliberately triggered the war and that most of his initial fighters were Russian citizens.",
   "date": "April 2014"
 },
 {
   "name": "Igor Girkin (Strelkov)",
   "statement": "We shot down a Ukrainian military transport plane",
   "context": "On July 17, 2014, Girkin initially boasted on social media about shooting down what he claimed was a Ukrainian An-26 military aircraft. This was actually Malaysia Airlines Flight 17 with 298 civilian passengers and crew.",
   "date": "July 17, 2014"
 },
 {
   "name": "Igor Girkin (Strelkov)",
   "statement": "The bodies on MH17 weren't fresh",
   "context": "After realizing MH17 was a civilian aircraft, Girkin spread conspiracy theories claiming many passengers had died days before the crash and the plane was filled with 'blood serum and medications.' These claims were part of Russian disinformation to deflect blame.",
   "date": "July 18, 2014"
 },
 {
   "name": "Igor Girkin (Strelkov)",
   "statement": "We receive no direct support from Russia",
   "context": "Throughout 2014, Girkin maintained that separatist forces operated independently with only volunteer support from Russia. He later admitted extensive Russian military equipment, personnel, and coordination were essential to separatist operations.",
   "date": "2014"
 },
 {
   "name": "Igor Girkin (Strelkov)",
   "statement": "Donetsk was peaceful until Ukrainian shelling",
   "context": "Girkin claimed Ukrainian forces initiated violence against peaceful Donetsk. He later admitted he deliberately escalated the conflict and was responsible for bringing the war to Donetsk, acknowledging Ukrainian shelling was a response to his provocations.",
   "date": "2014"
 },
 {
   "name": "Petro Poroshenko",
   "statement": "The war will be over in 24 hours",
   "context": "During his 2014 presidential campaign, Poroshenko repeatedly promised to end the Donbas conflict within hours or days of taking office. He claimed his business connections and negotiating skills would quickly resolve the crisis.",
   "date": "May 2014"
 },
 {
   "name": "Petro Poroshenko",
   "statement": "Ukraine will fully implement the Minsk Agreements",
   "context": "Poroshenko consistently promised parliament and international partners that Ukraine would fulfill all Minsk commitments. However, domestic opposition and the agreements' constitutional requirements made implementation impossible without destroying Ukrainian sovereignty.",
   "date": "September 2014-February 2015"
 },
 {
   "name": "Petro Poroshenko",
   "statement": "Ukrainian military casualties are minimal",
   "context": "Throughout 2014-2015, Poroshenko's administration significantly understated Ukrainian military losses to maintain public support. Medical officials and soldiers on the ground reported far higher casualty numbers than official government statistics.",
   "date": "2014-2015"
 },
 {
   "name": "Petro Poroshenko",
   "statement": "No Russian regular forces are fighting in Ukraine",
   "context": "Despite extensive evidence of Russian military equipment and personnel, Poroshenko initially downplayed direct Russian involvement to avoid escalation. He later acknowledged massive Russian military intervention after defeats at Ilovaisk and Debaltseve.",
   "date": "2014"
 },
 {
   "name": "Petro Poroshenko",
   "statement": "The ceasefire is holding successfully",
   "context": "After signing Minsk agreements, Poroshenko repeatedly claimed ceasefires were being observed despite daily violations documented by OSCE monitors. He minimized ongoing fighting to maintain international support for the peace process.",
   "date": "September 2014-February 2015"
 },
 {
   "name": "Barack Obama",
   "statement": "Red lines will have consequences",
   "context": "Obama and other Western leaders repeatedly warned of severe consequences if Russia crossed certain red lines in Ukraine. However, when Russia annexed Crimea and invaded Donbas, the actual response was limited sanctions rather than the promised severe costs.",
   "date": "February-March 2014"
 },
 {
   "name": "Angela Merkel",
   "statement": "Sanctions will deter further Russian aggression",
   "context": "Merkel and EU leaders claimed their economic sanctions would be sufficient to prevent Russian escalation and force withdrawal from Ukraine. Instead, Russia adapted to sanctions and continued military operations for eight years.",
   "date": "March 2014-ongoing"
 },
 {
   "name": "Western Officials",
   "statement": "There is no military solution to the Ukraine conflict",
   "context": "Western leaders consistently stated that only diplomatic solutions were possible, discouraging military assistance to Ukraine. This position emboldened Russian aggression by signaling Ukraine would receive insufficient support to defend itself militarily.",
   "date": "2014-2022"
 },
 {
   "name": "John Kerry",
   "statement": "Russia will face complete international isolation",
   "context": "Kerry promised Russia would be completely isolated internationally if it continued aggression in Ukraine. However, Russia maintained significant relationships with China, India, and other major powers throughout the conflict.",
   "date": "March 2014"
 },
 {
   "name": "François Hollande",
   "statement": "The Minsk process will bring lasting peace",
   "context": "Hollande repeatedly promoted the Minsk agreements as a pathway to sustainable peace in Ukraine. The agreements ultimately failed to end fighting and instead legitimized Russian territorial gains while constraining Ukrainian sovereignty.",
   "date": "September 2014-February 2015"
 }
]